/*Напишите программу, выводящую на экран ваше любимое стихотворение. Для разбиения на строчки используйте подходящую управляющую последовательность.*/
#include <iostream>
using namespace std;
int main(void)
{
	cout<<"Во глубине сибирских руд\nХраните гордое терпенье,\nНе пропадет ваш скорбный труд\nИ дум высокое стремленье.";
	
	return 0;
}
