/*Напишите программу, выводящую ваше имя и адрес*/
#include <stdio.h>
int main()
{
	printf("Maxim, email: ludmilakononova@mksat.net");
	getchar();
	return 0;
}