1. б в
2. george!=sally
3. -1 - ложное, 1 - истинное
4. инициализация отношение, переход к следующей итерации цикла
+-5. в
-6. нет
7. for(int i=1; i<101; i++)cout<<i<<' ';
8. фигурными скобками
9. в
10. int i=100; while(i<101){cout<<i<<' '; i++;}
11. нет
12. пока не будет выполнено заданное условие
13. int i=100; do{cout<<i<<' '; i++;}while(i!=100);
14. if(age>21)cout<<"yes";
15. г
16. if(age>21)cout<<yes; else cout<<"no";
+-17. а
18. введенный перед enter
+-19. противоположному условию if, если только if не истинный
20. добавления фигурных скобок
21. switch(ch){ case ch 'y': cout<<"yes"; break; default: "unknown"; break;}
22. if(speed>55)ticket=1; else ticket=0;
-23. а
24. limit==55 && speed>55;
25. унарные,арифметические,отношения,логические,условная,присваивания
-26. в
27. циклу
28. б.