{1.Задано непустий текст довжиною до 255 символів. В кожному слові тексту
вилучити всі повторні входження кожного із символів цього слова, залишивши
тільки останнє входження.}
program z1;
var s:string; i,n,p:byte;
  begin
    read(s);
    s:=s+' ';//последнее слово заканчивается пробелом
    n:=1; //n - проверяемая буква
    p:=1;
 while p<length (s) do
 begin
    while s[p]<>' ' do p:= p+1;//p- позиция пробела

    while n<p do
    begin
    i:=n+1;
    while i<p do
       if s[n]=s[i] then
            begin delete(s,n,1);
              p:=p-1;//подтягиваем пробел (так как при удалении пробел смещается назад)ж
              n:=n-1;
              i:=p;//заканчиваем перебор по взятой букве
            end
       else i:=i+1;
    n:=n+1;
   end;
    n:=p+1;
    p:=p+1;
 end;
   write(s); readln; readln;
  end.

